app/Http/Controllers/HomeController.php

select * from `roles` where `id` = 1 limit 1
select count(*) as aggregate from `posts` where `is_deleted` = 0
select count(*) as aggregate from `categories` where `is_deleted` = 0
select count(*) as aggregate from `tags` where `is_deleted` = 0
select count(*) as aggregate from `users` where `is_deleted` = 0
select count(*) as aggregate from `comments` where `is_deleted` = 0
select count(*) as aggregate from `comment_replies` where `is_deleted` = 0
select count(*) as aggregate from `posts` where `is_active` = 1 and `is_deleted` = 0
select count(*) as aggregate from `posts` where `is_active` = 0 and `is_deleted` = 0
---
    public function dashboard() {

        $role = Role::where('id',Auth::user()->role_id)->first();

        $name = strtolower($role->name);

        if( $name == "admin" || $name == "administrator" || $name == "super admin" || $name == "super administrator") {

            $post_count = Post::where('is_deleted',0)->count();
            $category_count = Category::where('is_deleted',0)->count();
            $tag_count = Tags::where('is_deleted',0)->count();
            $user_count = User::where('is_deleted',0)->count();
            $comment_count = Comments::where('is_deleted',0)->count();
            $reply_count = CommentReplies::where('is_deleted',0)->count();
            $active_post = Post::where('is_active', 1)->where('is_deleted',0)->count();
            $inactive_post = Post::where('is_active', 0)->where('is_deleted',0)->count();