app/Http/Controllers/HomeController.php

select count(*) as aggregate from `categories`
select count(*) as aggregate from `tags`
---
    public function dashboard() {

        $post_count = Post::count();
        $category_count = Category::count();
        $tag_count = Tags::count();