app/Http/Controllers/postsControllers.php

select * from `tags`
select * from `categories`
select * from `users` where `is_deleted` = 0 and `is_author` = 1
---
    public function create() {
        $tags = Tags::all();
        $categories = Category::all();
        $users = User::where('is_deleted',0)->where('is_author',1)->get();

select * from `categories`
---
    public function getPosts() {

        return response()->json([
            "posts" => Post::withCategory()->get() ,
            "success" => true ,
            "status_code" => 200,
        ]);