app/Http/Controllers/postsControllers.php

    public function manage_post() {
        $categories = Category::where('is_deleted' ,0)->get();
        $authors = User::where('is_deleted' ,0)->where('is_author',1)->get();
        $permission = DB::table("permissions")->where("created_by",Auth::id())->where('title','post')->first();
---
select * from `permissions` where `created_by` = 1 and `title` = 'post' limit 1