app/Http/Controllers/postsControllers.php

    public function index(Request $request) {
        $role = Role::where('id',Auth::user()->role_id)->first();
        $name = strtolower($role->name);

        if( $name == "admin" || $name == "administrator" || $name == "super admin" || $name == "super administrator") {
            $posts =  Post::with(['category','user','comments'])->orderBy('id','desc')->get();

            foreach($posts as $post) {
                $post->tags = DB::table("post_tags")->where("post_id","=",$post->id)
                ->join('tags','post_tags.tag_id','tags.id')
                ->select('name')
                ->get();
---
select * from `roles` where `id` = 1 limit 1
select * from `categories` where `categories`.`id` in (2, 13, 14, 15)
select * from `comments` where `comments`.`post_id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 15, 16, 17, 18)
select * from `posts` order by `id` desc
select * from `users` where `users`.`id` in (1, 2, 3)
select `name` from `post_tags` inner join `tags` on `post_tags`.`tag_id` = `tags`.`id` where `post_id` = 18

    public function manage_post() {
        $categories = Category::where('is_deleted' ,0)->get();
        $authors = User::where('is_deleted' ,0)->where('is_author',1)->get();
        $permission = DB::table("permissions")->where("created_by",Auth::id())->where('title','post')->first();
---
select * from `categories` where `is_deleted` = 0
select * from `users` where `is_deleted` = 0 and `is_author` = 1
select * from `permissions` where `created_by` = 1 and `title` = 'post' limit 1

    public function addPostPage() {
        $tags = Tags::where('is_deleted',0)->get();
        $categories = Category::where('is_deleted',0)->get();
        $users = User::where('is_deleted',0)->where('is_author',1)->get();
        $sections = Section::where('status',1)->get();
---
select * from `users` where `is_deleted` = 0 and `is_author` = 1
select * from `sections` where `status` = 1

    public function store(Request $request) {

        $image = $request->file('image');
        $imageName = rand(). '.' . $image->extension();
        $image->move(public_path('images'), $imageName);

        $post = new Post();
        $post->title = $request->title;
        $post->slug = Str::slug($request->title, '-');
        $post->cat_id = $request->category;
        $post->section = $request->section;
        $post->image = $imageName;
        $post->description = $request->description;
        $post->created_by = Auth::user()->id;
---
insert into `posts` (`title`, `slug`, `cat_id`, `tags_id`, `author`, `description`, `meta_title`, `meta_tags`, `meta_description`, `created_by`, `image`, `updated_at`, `created_at`) values ('Qui sit commodi at', 'qui-sit-commodi-at', '19', '2, 3, 5', '', '', 'Qui sit commodi at', 'Totam velit duis do,zxc,dsas,we,vc', 'Irure non ullamco in', 1, 'storage/posts/0x0-chargeport_04.jpg', '2022-03-03 20:18:48', '2022-03-03 20:18:48')

    public function updatePost(Request $request) {

        $post = Post::find($request->post_id);
---
select * from `posts` where (`id` is null) limit 1