app/Http/Controllers/siteController.php

    public function userHomePage(Request $request) {
        $singleheader = Post::where('is_active',1)->where('section',1)->inRandomOrder()->limit(1)->first();
---
select * from `posts` where `is_active` = 1 and `section` = 1 order by RAND() limit 1